---
kind: enumMember
id: F:Autodesk.Revit.DB.Fabrication.DesignToFabricationConverterResult.Success
enum: Autodesk.Revit.DB.Fabrication.DesignToFabricationConverterResult
source: html/e2792594-c085-0582-9ff8-3eb8ea726bdc.htm
---
# Autodesk.Revit.DB.Fabrication.DesignToFabricationConverterResult.Success

Conversion was successful.